app/controllers/songs_controller.rb

SELECT  "artists".* FROM "artists" WHERE "artists"."id" = ? LIMIT 1  [["id", 1]]
SELECT "songs".* FROM "songs"
---
  def index
    if params[:artist_id]
      # if song artist exists
      # @artist = Artist.find(params[:artist_id]) # doesnt account for nil, will just error out
      @artist = Artist.find_by(id: params[:artist_id])
      #but you can enter any number for artist id in the route
      if @artist.nil?
        redirect_to artists_path, alert: "Artist not found"
      else
        @songs = @artist.songs
      end
    else
      @songs = Song.all